uhnp/src/Catalogs/ШаблоныЗаполнения/ШаблоныЗаполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЗаполнения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРодитель</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаОтбора</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполненияШаблона</name>
    <type>
      <types>CatalogRef.ВариантыЗаполненияШаблонов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыШаблона</name>
    <attributes>
      <name>НаименованиеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТабличнаяЧасть</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТаблицы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизита</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCalculationTypesRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/НазначенияШаблонов/НазначенияШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияШаблонов</name>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ВариантыЗаполненияШаблонов/ВариантыЗаполненияШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыЗаполненияШаблонов</name>
  <predefined>
    <items>
      <name>НастройкиПроцессаВыбораПоКомиссии</name>
      <description>По комиссии (настройки процесса выбора)</description>
    </items>
    <items>
      <name>НастройкиПроцессаВыбораПоЭтапамИКритериям</name>
      <description>По этапам и критериям (настройки процесса выбора)</description>
    </items>
    <items>
      <name>НастройкиПроцессаВыбораПолный</name>
      <description>Полный (настройки процесса выбора)</description>
    </items>
  </predefined>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ШаблоныЗаполнения/Forms/ФормаПомощникВводаШаблонаНастройкиПроцессаВыбора/Module.bsl
// Заполняет таблицу вариантов заполнения шаблонов согласно данным информационной базы.
&НаСервере
Процедура ЗаполнитьТаблицуВариантов()
	ТаблицаВариантовЗаполнения.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВариантыЗаполненияШаблонов.Ссылка КАК Ссылка,
		|	ВариантыЗаполненияШаблонов.Назначение,
		|	ВариантыЗаполненияШаблонов.ИмяРодителя
		|ИЗ
		|	Справочник.ВариантыЗаполненияШаблонов КАК ВариантыЗаполненияШаблонов
		|ГДЕ
		|	ВариантыЗаполненияШаблонов.Назначение = &Назначение
		|	И ВариантыЗаполненияШаблонов.ИмяРодителя = &ИмяРодителя
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	Запрос.УстановитьПараметр("ИмяРодителя", "НастройкиПроцессаВыбора");
	Запрос.УстановитьПараметр("Назначение", Перечисления.НазначенияШаблонов.Справочник);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Выбрано = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаВариантовЗаполнения.Добавить();
		Если НЕ Выбрано Тогда
			НоваяСтрока.Использование = Истина;
			Выбрано = Истина;
		Иначе
			НоваяСтрока.Использование = Ложь;
		КонецЕсли;
		НоваяСтрока.ВариантЗаполненияШаблона = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецПроцедуры

// Возвращает выбранный пользователем элемент варианта заполнения шаблона.
&НаКлиенте
Функция ПолучитьВыбранныйВариант()
	РезультатФункции = ПредопределенноеЗначение("Справочник.ВариантыЗаполненияШаблонов.ПустаяСсылка");
	Найдено = Ложь;
	Для Каждого ТекТаблицаВариантовЗаполнения Из ТаблицаВариантовЗаполнения Цикл
		Если ТекТаблицаВариантовЗаполнения.Использование Тогда
			Если НЕ Найдено Тогда
				РезультатФункции = ТекТаблицаВариантовЗаполнения.ВариантЗаполненияШаблона;
				Найдено = Истина;
			Иначе
				РезультатФункции = ПредопределенноеЗначение("Справочник.ВариантыЗаполненияШаблонов.ПустаяСсылка");
				Прервать;			// Два значения.
			КонецЕсли;
		Иначе
			Продолжить;		// Выполняем поиск далее.
		КонецЕсли;
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаПроцессаВыбора = Параметры.НастройкаПроцессаВыбора;
	НаименованиеШаблона = Справочники.ШаблоныЗаполнения.ПолучитьНаименованиеШаблонаПоУмолчанию(НастройкаПроцессаВыбора);
	ЗаполнитьТаблицуВариантов();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовЗаполненияИспользованиеПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаВариантовЗаполнения.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Для Каждого ТекТаблицаВариантовЗаполнения Из ТаблицаВариантовЗаполнения Цикл
			ВариантыСовпадают = (ТекТаблицаВариантовЗаполнения.ВариантЗаполненияШаблона = ТекДанные.ВариантЗаполненияШаблона);
			ТекТаблицаВариантовЗаполнения.Использование = ВариантыСовпадают;
		КонецЦикла;
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблон(Команда)
	ВыбранныйВариант = ПолучитьВыбранныйВариант();
	Если ЗначениеЗаполнено(ВыбранныйВариант) Тогда
		СтруктураВыбора = Новый Структура;
		СтруктураВыбора.Вставить("ВыбранныйВариант", ВыбранныйВариант);
		СтруктураВыбора.Вставить("Наименование", НаименованиеШаблона);
		ОповеститьОВыборе(СтруктураВыбора);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось определить выбранный вариант заполнения шаблона. Операция отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры
